In [1]:
#add dependencies
import pandas as pd
import os

In [3]:
#Load file
grad_1516_df=pd.read_csv('../Graduation15-16.csv')
grad_1516_df.head()

       CDS_CODE  ETHNIC GENDER  GRADS  UC_GRADS  YEAR
0  1.100170e+12       6      F     23        23  1516
1  1.100170e+12       5      M     18        18  1516
2  1.100170e+12       1      F      1         1  1516
3  1.100170e+12       9      M      1         1  1516
4  1.100170e+12       9      F      2         2  1516

In [4]:
#Determine any missing values
grad_1516_df.dropna()
grad_1516_df.count()

CDS_CODE    21545
ETHNIC      21545
GENDER      21545
GRADS       21545
UC_GRADS    21545
YEAR        21545
dtype: int64

In [5]:
#Determine data types
grad_1516_df.dtypes

CDS_CODE    float64
ETHNIC        int64
GENDER       object
GRADS         int64
UC_GRADS      int64
YEAR          int64
dtype: object

In [6]:
cleaned_grad_1516_df=grad_1516_df[['CDS_CODE','ETHNIC','GRADS','UC_GRADS']]
cleaned_grad_1516_df

           CDS_CODE  ETHNIC  GRADS  UC_GRADS
0      1.100170e+12       6     23        23
1      1.100170e+12       5     18        18
2      1.100170e+12       1      1         1
3      1.100170e+12       9      1         1
4      1.100170e+12       9      2         2
...             ...     ...    ...       ...
21540  5.872770e+13       7     41        21
21541  5.872770e+13       6      4         3
21542  5.872770e+13       0      2         0
21543  5.872770e+13       9      8         3
21544  5.872770e+13       7     42        16

[21545 rows x 4 columns]

In [7]:
cleaned_grad_1516_df['CDS_CODE'] = cleaned_grad_1516_df['CDS_CODE'].astype('int64') 
cleaned_grad_1516_df.head()

C:\Users\hhngu\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

        CDS_CODE  ETHNIC  GRADS  UC_GRADS
0  1100170000000       6     23        23
1  1100170000000       5     18        18
2  1100170000000       1      1         1
3  1100170000000       9      1         1
4  1100170000000       9      2         2